In [2]:
import pandas as pd
df=pd.read_csv('data/salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
inputs=df.drop('salary_more_then_100k',axis=1)
target=df['salary_more_then_100k']

In [4]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

## One Hot Encoding

In [5]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
inputs['company_n']=le.fit_transform(inputs['company'])
inputs['job_n']=le.fit_transform(inputs['job'])
inputs['degree_n']=le.fit_transform(inputs['degree'])
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [7]:
inputs=inputs.drop(['company','job','degree'],axis=1)
inputs.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [8]:
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier

x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)
model=DecisionTreeClassifier()
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [9]:
model.score(x_test,y_test)

0.75

In [10]:
model.predict([[2,2,1]]) # Google=2, sales executive=2, masters=1

array([0], dtype=int64)

# Solving Practice Problem

In [37]:
df=pd.read_csv('data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [38]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Cabin','Embarked','Ticket'],axis=1)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [39]:
inputs=df.drop('Survived',axis=1)
target=df['Survived']

**Label Encoding**

In [40]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
inputs['Sex']=le.fit_transform(inputs['Sex'])
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

**Cleaning Data**

In [47]:
inputs.isna().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [48]:
inputs['Age'].fillna(df['Age'].median(),inplace=True)
inputs.isna().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

**Model training**

In [49]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)
model=DecisionTreeClassifier()
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [50]:
model.score(x_test,y_test)

0.7932960893854749